function randomDiap(n,m) {
            return Math.floor(Math.random()*(m-n+1))+n;
    }

    function mood(colorsCount) {
        const colors=[ '', "красный", "оранжевый", "жёлтый", "зелёный", "голубой", "синий", "фиолетовый", "розовый", "бордовый", "пурпурный", "лиловый", "сиреневый", "бирюзовый", "изумрудный", "хаки", "коричневый", "бежевый", "кремовый", "белый", "чёрный", "серый", "серебристый", "золотой", "медный", "малиновый", "коралловый", "терракотовый", "шоколадный", "морской волны", "индиго", "фуксия", "лососевый", "оливковый", "песочный", "сапфировый", "лазурный", "янтарный", "алый", "пепельный", "кирпичный", "мятный", "лавандовый", "персиковый", "нефритовый", "платиновый", "сливовый", "карминовый", "маренго", "цвет морской волны", "пастельный голубой", "пастельный розовый", "цвет шампанского" ];
let used = {};
let count = 0
        console.log( 'цветов: ' + colorsCount );
       while (count < colorsCount){
         const n = randomDiap(1, 50);
          const colorName = colors[n];
     
      
      if(!(colorName in used)){
        used[colorName] = true;
        console.log( colorName );
        count++
         } 
      }                                          
        } 
    mood(30);